my_list=[1, 2, 3]
print('Исходный список:', my_list)
my_list[0]=100
print('Измененный список:', my_list)
#Поменял первый элемент списка

my_tuple=(1, 2, 3)
print('Исходный список:', my_tuple)
my_tuple[0]=100
print('Попытка изменить список:', my_tuple)
#Попытался поменять кортеж, т.к. он неизменяемый ничего не получилось

my_string='cat'
print('Изначальная строка:', my_string)
my_string[0]='b'
print('Измененная строка:', my_string)
#Попытка изменить строку тоже не увенчалась успехом, строка тоже является неизменяемой переменной