
print("┌──────────────────────────────────────────┐")
print("│        📦 СТАТУС ВАШЕГО ЗАКАЗА 📦       │")
print("└──────────────────────────────────────────┘")

status=str(input('Введите статус вашего заказа: '))

match status:
    case 'processing':
        print(f'\nСтатус: В обработке⚙️\nОписание: Мы собираем и упаковываем ваш заказ на складе\nПримерное время ожидания:1-3 часа\nРекомендация: Сокро заказ будет передан в службу доставки')
    
    case 'pending':
        print(f'\nСтатус: В ожидании⏳\nОписание: Ваш заказ ожидает подтверждения и оплаты\nУ вас есть 15 минут на оплату заказа\nРекомендация: Пожалуйста, проверьте статус вашей оплаты')
    
    case 'shipped':
        print(f'\nСтатус: Отправлено✈️\nОписание: Ваш заказ находится в пути к вам\nПримерное время ожидания: 2-5 дней\nРекомендация: Следите за уведомлениями о доставке')
    
    case 'delivered':
        print(f'\nСтатус: Доставлено✅\nОписание: Заказ успешно доставлен в пункт выдачи или курьером\nПримерное время ожидания: Заказ уже на месте\nРекомендация: Заберите заказ')
    
    case 'cancelled':
        print(f'\nСтатус: Отменено🚫\nОписание: Заказ был отменен покупателем или магазином\nРекомендация: Деньги вернутся на ваш счет в течение 3 дней')
    
    case _:
        print(f'\n❌ Ошибка: Неизвестный статус "{status_code}"\n📋 Доступные статусы: pending, processing, shipped, delivered, cancelled\n')
