rate=int(input('Введите рейтинг продукта от 1 до 10'))

match rate:
    case 9|10:
        print(f'Рейтинг продукта {rate} → Это отличный продукт!🌟 Настоятельно рекомендую!')
    
    case 4|5:
        print(f'Рейтинг продукта {rate} → Это средний продукт.😐 Можно попробовать.')
    
    case 1|2|3:
        print(f'Рейтинг продукта {rate} → Это плохой продукт.❌ Не рекомендую.')
    
    case 6|7|8:
        print(f'Рейтинг продукта {rate} → Это хороший продукт.👍 Стоит попробовать.')
    
    case _:
        print(f'⚠️Вы ввели неккоректное значение⚠️')
        