import random

answers=['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом', 'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name=str(input('Введите ваше имя: '))
print(f'Привет {name}!')

while True:
    input('Введите ваш вопрос: ')
    result=random.choice(answers)
    print(result)
    n=str(input('Вы хотите задать еще один вопрос?(Да/Нет)').upper())
    if n=='ДА':
        continue
    else:
        print('Возвращайся, если возникнут вопросы!')
        break